---
kind: type
id: T:Autodesk.Revit.DB.FabricationItemFolder
source: html/c5443900-2aef-889e-84ff-0f6baa641c40.htm
---
# Autodesk.Revit.DB.FabricationItemFolder

A fabrication item folder that can contain sub folders and access to the FabricationItemFile s contained within.

## Syntax (C#)
```csharp
public class FabricationItemFolder : IDisposable
```